import { Injectable } from '@angular/core';
import { OrderItem, Product } from '../interfaces/app-interfaces';

@Injectable({
  providedIn: 'root'
})
export class CartService {

  private orderItems: OrderItem[] = [
    {
      product : {
        id: 1,
        name: "Loreal",
        description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
        price: 1200,
        category: "мужские",
        imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
      },
      quantity: 2
    },
    {
      product : {
        id: 2,
        name: "Loreal",
        description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
        price: 1200,
        category: "мужские",
        imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
      },
      quantity: 2
    },
    {
      product : {
        id: 3,
        name: "Loreal",
        description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
        price: 1200,
        category: "мужские",
        imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
      },
      quantity: 2
    },
    {
      product : {
        id: 4,
        name: "Loreal",
        description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
        price: 1200,
        category: "мужские",
        imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
      },
      quantity: 2
    },

    {
      product: {
        id: 5,
        name: "Loreal Paris sfsdfsdf sf sdfsdfsdfsdf",
        description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
        price: 3200,
        category: "женские",
        imageUrl: "../../assets/images/AUX_3234c6f2-9383-4687-8d1b-496b8a447cc6.webp"
      },
      quantity: 1
    }
  ]

  public totalCount(): number {
    let inititalValue = 0;
    let total = this.orderItems.reduce((sum, item) => sum + item.product.price * item.quantity, 0)
    return total
  }
  public getOrderItems(): OrderItem[] {
    return this.orderItems
  }

  private getOrderItemById(id: number): OrderItem | null {
    return this.orderItems.find(i => i.product.id === id) ?? null
  } 

  public increaseItemCount(id: number): void {
    let item = this.getOrderItemById(id)
    if(item)
      item.quantity++    
  }

  public decreaseItemCount(id): void {
    let item = this.getOrderItemById(id)
    if(item)
      item.quantity--
  }

  public addItem(product: Product): void {
    let item = this.getOrderItemById(product.id)
    if(item)
      item.quantity++;
    else
      this.orderItems.push({ product: product, quantity : 1 })
  }

  public removeItem(id: number): void {   
    this.orderItems = this.orderItems.filter(i => i.product.id !== id)
  }
  constructor() { }
}
