import { Injectable } from '@angular/core';
import { Product } from '../interfaces/app-interfaces';
import { Observable, of } from 'rxjs';

@Injectable({
  providedIn: 'root'
})
export class ProductService {  
  private products: Product[] = [
    {
      id: 1,
      name: "Loreal",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 1200,
      category: "мужские",
      imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
    },
    {
      id: 2,
      name: "Loreal Paris",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 3200,
      category: "женские",
      imageUrl: "../../assets/images/AUX_3234c6f2-9383-4687-8d1b-496b8a447cc6.webp"
    },
    {
      id: 3,
      name: "Beluchi",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 1900,
      category: "мужские",
      imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
    },
    {
      id: 4,
      name: "Huyuchi",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 1700,
      category: "женские",
      imageUrl: "../../assets/images/AUX_3234c6f2-9383-4687-8d1b-496b8a447cc6.webp"
    },
    {
      id: 5,
      name: "Berlin Paris",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 4200,
      category: "мужские",
      imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
    },
    {
      id: 6,
      name: "Some thing",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 1200,
      category: "женские",
      imageUrl: "../../assets/images/AUX_3234c6f2-9383-4687-8d1b-496b8a447cc6.webp"
    },
    {
      id: 7,
      name: "Crockodile",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 3200,
      category: "мужские",
      imageUrl: "../../assets/images/EX_237251b4-b770-4b0c-8bee-7b95748190b1.webp"
    },
    {
      id: 8,
      name: "Belisimo",
      description: "Созданная Карин Дюбрей и Майей Лерну из японского парфюмерного Дома Tagasako, композиция Ginza гармонично сочетает в себе традиции японской парфюмерии и истинно современное прочтение.Композиция раскрывается ярким сиянием искрящихся нот граната и пикантностью нот розового перца. Сердце аромата благоухает самыми восхитительными гранями жасмина. Три цветка сплетаются, создавая изысканно отточенное звучание теплой и свежей, легкой и пьянящей чувственности. Магнолия и фрезия кружатся в вихре лепестков. Японская орхидея придает цветочному букету штрих таинственности. Цветочная чувственность аромата становится неожиданно мощной, словно отточенной древесными нотами Хиноки. Священный японский кипарис придает композиции неподражаемый почерк, одновременной сильный и нежный, с легкой камфорной нотой. Его самая раскаленная грань эхом перекликается с глубиной сандаловой древесины и интенсивностью пачулей. На коже аромат обретает совершенно неповторимое, женственное и проникновенное звучание.",
      price: 11200,
      category: "женские",
      imageUrl: "../../assets/images/AUX_3234c6f2-9383-4687-8d1b-496b8a447cc6.webp"
    }
  ]
  constructor() { }

  public getFilteredProducts(category: string): Observable<Product[]> {
    return of(this.products)
  }

  public getProductById(id: number) : Observable<Product> {
    return of(this.products.filter(p => p.id === id)[0])
  }

  public getProductsByName(name: string) : Observable<Product[]> {
    return of(this.products.filter(p => p.name.toLocaleLowerCase().includes(name.toLocaleLowerCase())))
  }
}
